In [27]:
import pandas as pd
import numpy as np

In [42]:
stats =  pd.DataFrame(
    {
        'teams': ['Pakistan','India','Srilanka','S. Africa'],
        'played' :[5,6,4,5],
        'points' : [10,8,8,6]
    },
    index=['t1','t2','t3','t4']
)

In [29]:
stats

        teams  played  points
t1   Pakistan       5      10
t2      India       6       8
t3   Srilanka       4       8
t4  S. Africa       5       6

In [30]:
stats.head(2)#first two rows

       teams  played  points
t1  Pakistan       5      10
t2     India       6       8

In [31]:
stats.tail(2)#last two rows

        teams  played  points
t3   Srilanka       4       8
t4  S. Africa       5       6

In [32]:
stats['teams']#column wise

t1     Pakistan
t2        India
t3     Srilanka
t4    S. Africa
Name: teams, dtype: object

In [33]:
stats.iloc[0]

teams     Pakistan
played           5
points          10
Name: t1, dtype: object

In [34]:
stats.loc['t1']

teams     Pakistan
played           5
points          10
Name: t1, dtype: object

In [35]:
#getting numpy array
stats.values

array([['Pakistan', 5, 10],
       ['India', 6, 8],
       ['Srilanka', 4, 8],
       ['S. Africa', 5, 6]], dtype=object)

In [36]:
stats['No.']= np.arange(1,5)

In [37]:
stats

        teams  played  points  No.
t1   Pakistan       5      10    1
t2      India       6       8    2
t3   Srilanka       4       8    3
t4  S. Africa       5       6    4

In [38]:
stats.iloc[0:3,2] #specify row then column

t1    10
t2     8
t3     8
Name: points, dtype: int64

In [43]:
new_stats = stats.drop("teams",axis=1)# This is not in-place/ in-memory operation

In [44]:
display(stats)
display(new_stats)

        teams  played  points
t1   Pakistan       5      10
t2      India       6       8
t3   Srilanka       4       8
t4  S. Africa       5       6

    played  points
t1       5      10
t2       6       8
t3       4       8
t4       5       6

In [40]:
stats.drop("teams",axis=1,inplace=True)#This will delete the team column permanently

In [41]:
stats

    played  points  No.
t1       5      10    1
t2       6       8    2
t3       4       8    3
t4       5       6    4

In [51]:
stats["win"] = stats['points']/2
stats["win"] = stats["win"].astype(int)#changing the datatype
stats

        teams  played  points  win
t1   Pakistan       5      10    5
t2      India       6       8    4
t3   Srilanka       4       8    4
t4  S. Africa       5       6    3

In [56]:
def calculate_loss_tie(row):
    return row['played'] - row['win']

In [58]:
stats['loss_tie']=stats.apply(calculate_loss_tie,axis=1)

In [59]:
stats

        teams  played  points  win  loss_tie
t1   Pakistan       5      10    5         0
t2      India       6       8    4         2
t3   Srilanka       4       8    4         0
t4  S. Africa       5       6    3         2

In [ ]:
stats['points'].idxmax()#for maximum points

In [65]:

index = stats['points'].idxmax()#row with maximum point by index

In [66]:
stats.loc[index]

teams       Pakistan
played             5
points            10
win                5
loss_tie           0
Name: t1, dtype: object

In [67]:
stats.describe()

         played     points       win  loss_tie
count  4.000000   4.000000  4.000000  4.000000
mean   5.000000   8.000000  4.000000  1.000000
std    0.816497   1.632993  0.816497  1.154701
min    4.000000   6.000000  3.000000  0.000000
25%    4.750000   7.500000  3.750000  0.000000
50%    5.000000   8.000000  4.000000  1.000000
75%    5.250000   8.500000  4.250000  2.000000
max    6.000000  10.000000  5.000000  2.000000

In [69]:
stats.sum()

teams       PakistanIndiaSrilankaS. Africa
played                                  20
points                                  32
win                                     16
loss_tie                                 4
dtype: object

In [93]:
stats.to_csv('data.csv')#saving the dataframe into a csv file
stats.to_excel('data.xlsx')#saving the dataframe into an excel file

In [74]:
my_data = pd.read_csv('data.csv',index_col=0)# reading a csv file (index_col=0) first column will be used as the index

In [75]:
my_data

        teams  played  points  win  loss_tie
t1   Pakistan       5      10    5         0
t2      India       6       8    4         2
t3   Srilanka       4       8    4         0
t4  S. Africa       5       6    3         2

In [95]:
my_data = pd.read_excel('data.xlsx',index_col=0,header=None)
display(my_data)

             1       2       3    4         5
0
NaN      teams  played  points  win  loss_tie
t1    Pakistan       5      10    5         0
t2       India       6       8    4         2
t3    Srilanka       4       8    4         0
t4   S. Africa       5       6    3         2

In [101]:
my_data.drop(my_data.index[0],axis=0,inplace=True)

In [102]:
my_data

            1  2   3  4  5
0
t1   Pakistan  5  10  5  0
t2      India  6   8  4  2
t3   Srilanka  4   8  4  0
t4  S. Africa  5   6  3  2

In [103]:
my_data.columns=['Teams','played','points','win','loss/tie']

In [104]:
my_data

        Teams played points win loss/tie
0
t1   Pakistan      5     10   5        0
t2      India      6      8   4        2
t3   Srilanka      4      8   4        0
t4  S. Africa      5      6   3        2

In [108]:
stds = pd.read_excel('students.xlsx')

In [114]:
stds.to_csv('students.csv')

In [115]:
students = pd.read_csv('students.csv')